src/Catalogs/ВидыПлановКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ВидыПлановКомпании</Name>
			<Comment>Виды планов при планировании</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.ВидыПлановКомпании</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодичностьПланирования</Name>
					<Comment>Периодичность заполнения и сверки плановых и фактических документов</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьАнализаНакопительныхСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъектаПланирования</Name>
					<Comment>Используется для фильтрации состава аналитических объектов в обработках заполнения</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитическиеРазрезыПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАналитикиПланирования1</Name>
					<Comment>Тип первого аналитического реквизита таблицы план-фактных документов</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитическиеРазрезыПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАналитикиПланирования2</Name>
					<Comment>Тип второго аналитического реквизита таблицы план-фактных документов</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитическиеРазрезыПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательПлана1</Name>
					<Comment>Наименование первого числового показателя документов планирования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательПлана2</Name>
					<Comment>Наименование второго числового показателя документов планирования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательПлана3</Name>
					<Comment>Наименование третьего числового показателя документов планирования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыПлана</Name>
					<Comment>Список параметров плановых документов</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПараметра</Name>
							<Comment>Параметр планового документа</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначения</Name>
							<Comment>Тип значения параметра планового документа</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БазовыеПланы</Name>
					<Comment>Список видов планов, от которых зависит заполнение планов данного вида</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПлана</Name>
							<Comment>Вид плана, от которого зависит данный</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПлановКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗависимости</Name>
							<Comment>По своему подразделению, по вложенным подразделениям, по родительскому подразделению</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗависимостейПланов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектПланированияПоАналитике</Name>
							<Comment>Объект планирования не связан с базовым по объекту планирования, или номер аналитики базового плана</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыборОбъектаПланированияПоАналитике</Name>
							<Comment>Объект планирования не связан с базовым по объекту планирования, или номер аналитики базового плана</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
					<Comment>Табличная часть, содержащая список подразделений</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Comment>Подразделение компании</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтсрочкаПлана</Name>
							<Comment>Количество дней отсрочки плана от начала периода планирования</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтсрочкаФакта</Name>
							<Comment>Количество дней отсрочки факта от конца периода планирования для расчета факта</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтчетыИОбработки</Name>
					<Comment>Перечень отчетов и обработок, связанных с данным объектом</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Comment>Наименование отчета / обработки для интерактивного выбора</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОбъекта</Name>
							<Comment>Переключатель типа и местонахождения объекта</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКОбъекту</Name>
							<Comment>Имя объекта метаданных или путь к файлу объекта</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФлагЗаполненияПлана</Name>
							<Comment>Признак наличия процедуры заполнения планового документа по установленным параметрам</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФлагПроверкиПлана</Name>
							<Comment>Признак наличия процедуры проверки планового документа по установленным параметрам</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФлагЗаполненияФакта</Name>
							<Comment>Признак наличия процедуры заполнения фактического документа по установленным параметрам</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыборВидаОбъекта</Name>
							<Comment>Переключатель типа и местонахождения объекта</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Documents/ПланФакт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПланФакт</Name>
			<Comment>План / факт</Comment>
			<BasedOn>
				<xr:Item>Document.ПланФакт</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
				<xr:Item>AccumulationRegister.Планирование</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПлана</Name>
					<Comment>Вид плана</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПлановКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектПланирования</Name>
					<Comment>Объект планирования</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.АналитическиеРазрезыПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала планирования</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Comment>Дата окончания планирования</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ-основание</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланФакт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
					<Comment>Показатели</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидАналитикиПланирования1</Name>
							<Comment>Вид аналитики планирования 1</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АналитическиеРазрезыПланирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидАналитикиПланирования2</Name>
							<Comment>Вид аналитики планирования 2</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АналитическиеРазрезыПланирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательПлана1</Name>
							<Comment>Показатель плана 1</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательПлана2</Name>
							<Comment>Показатель плана 2</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательПлана3</Name>
							<Comment>Показатель плана 3</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыПлана</Name>
					<Comment>Параметры плана</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПараметра</Name>
							<Comment>Вид параметра</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Comment>Значение параметра</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ПараметрыПланирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Catalogs/ВидыПлановКомпании/Forms/ФормаЭлемента/Ext/Form/Module.bsl
// Модуль формы элемента справочника "Виды планов компании"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Обработчик результата оповещения выбора значения в поле путь к объекту.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура ОбработкаРезультатаОповещенияПутьКОбъекту(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Проверяем статус закрытия окна параметров
	Если РезультатОповещения=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКОбъекту = РезультатОповещения.Значение;
	Наименование = РезультатОповещения.Представление;
	
	Если ПутьКОбъекту="ВЫБРАТЬ ИЗ диалога" Тогда
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогОткрытияФайла.Каталог = КаталогДокументов();
		Если Элементы.ОтчетыИОбработки.ТекущиеДанные.ВидОбъекта=2 Тогда
			Фильтр = "Текстовый файл(*.txt)|*.txt";
		Иначе
			Фильтр = "Внешняя обработка(*.epf)|*.epf";
		КонецЕсли;
		ДиалогОткрытияФайла.Фильтр = Фильтр;
		ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
		ДиалогОткрытияФайла.Заголовок = НСтр("ru = 'Выберите файл'");
		Если ДиалогОткрытияФайла.Выбрать() Тогда
			ПутьКОбъекту=ДиалогОткрытияФайла.ВыбранныеФайлы[0];
		Иначе
			ПутьКОбъекту="";
		КонецЕсли;
	КонецЕсли;
	
	Если РезультатОповещения<>Неопределено Тогда
		Элементы.ОтчетыИОбработки.ТекущиеДанные.ПутьКОбъекту=ПутьКОбъекту;
		Элементы.ОтчетыИОбработки.ТекущиеДанные.Наименование=Наименование;
	Иначе
		Элементы.ОтчетыИОбработки.ТекущиеДанные.ПутьКОбъекту="";
		Элементы.ОтчетыИОбработки.ТекущиеДанные.Наименование="";
	КонецЕсли;
	Элементы.ОтчетыИОбработки.ЗакончитьРедактированиеСтроки(Ложь);
	
КонецПроцедуры // ОбработкаРезультатаОповещенияПутьКОбъекту()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Производит настройку параметров выбора элементов управления диалога в зависимости от значений реквизитов объекта.
//
&НаСервере
Процедура НастроитьПараметрыВыбораЭлементовФормы()
	
	// Вызываем общий обработчик события настройки параметров выбора
	УправлениеДиалогомСправочникаСервер.НастроитьПараметрыВыбораЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры // НастроитьПараметрыВыбораЭлементовФормы()

// Производит настройку параметров отображения элементов управления диалога в зависимости от значений реквизитов
// объекта.
//
&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомСправочникаСервер.УправлениеДиалогомНаСервере(ЭтотОбъект);
	
КонецПроцедуры // УправлениеДиалогомНаСервере()

// Производит настройку условного оформления формы.
//
&НаСервере
Процедура УстановитьУсловноеОформление()
 
	// Вызываем общий обработчик действия.
	УправлениеДиалогомСправочникаСервер.УстановитьУсловноеОформление(ЭтотОбъект);
	
КонецПроцедуры // УстановитьУсловноеОформление()

// Производит настройку блокировки элементов формы.
//
&НаСервере
Процедура БлокироватьЭлементыФормы()
	
		// Проверим участвует ли реквизит в движениях
	НеобходимостьБлокировки = ОбработкаСобытийОбъектаСервер.ПроверитьИспользованиеСсылки(Объект.Ссылка,"Документ.ПланФакт","ВидПлана");
	
	// Составим список элементов для блокировки
	СписокРеквизитов = Новый СписокЗначений();
	СписокРеквизитов.Добавить("ВидАналитикиПланирования1", "ВидАналитикиПланирования1", НеобходимостьБлокировки);
	СписокРеквизитов.Добавить("ВидАналитикиПланирования2", "ВидАналитикиПланирования2", НеобходимостьБлокировки);
	СписокРеквизитов.Добавить("ПоказательПлана1"         , "ПоказательПлана1"         , НеобходимостьБлокировки);
	СписокРеквизитов.Добавить("ПоказательПлана2"         , "ПоказательПлана2"         , НеобходимостьБлокировки);
	СписокРеквизитов.Добавить("ПоказательПлана3"         , "ПоказательПлана3"         , НеобходимостьБлокировки);
	СписокРеквизитов.Добавить("ПериодичностьПланирования", "ПериодичностьПланирования", НеобходимостьБлокировки);
	
	// Заблокируем элементы формы
	УправлениеДиалогомСервер.БлокироватьЭлементыФормы(ЭтотОбъект,СписокРеквизитов);
	
КонецПроцедуры // БлокироватьЭлементыФормы()

// Обработчик события возникающего при нажатии программно добавленной кнопки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаКомандыФормыНаСервере()

// Подключаемый обработчик, вызывающий общую процедуру для обработки команды панели действий.
// 
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеДиалогомСправочникаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	// Вызываем общий обработчик результата выполнения действия
	УправлениеДиалогомСправочникаКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ "ПАРАМЕТРЫ ПЛАНИРОВАНИЯ"

// Обработчик события возникающего при изменении данных реквизита "Вид параметра" в контексте сервера.
//
&НаСервере
Процедура ПараметрыПланаВидПараметраПриИзмененииНаСервере()
	
	ТекущиеДанные = Объект.ПараметрыПлана.НайтиПоИдентификатору(Элементы.ПараметрыПлана.ТекущаяСтрока);
	
	Если Элементы.ПараметрыПланаТипЗначения.Видимость Тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.ВидПараметра) Тогда
			ТекущиеДанные.ТипЗначения = ТекущиеДанные.ВидПараметра.ТипЗначения;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПараметрыПланаВидПараметраПриИзмененииНаСервере()

// Обработчик события возникающего при изменении данных реквизита "Вид параметра" в контексте клиента.
//
&НаКлиенте
Процедура ПараметрыПланаВидПараметраПриИзменении(Элемент)
	
	ПараметрыПланаВидПараметраПриИзмененииНаСервере();
	
КонецПроцедуры // ПараметрыПланаВидПараметраПриИзменении()


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ "БАЗОВЫЕ ПЛАНЫ"

// Обработчик события возникающего при изменении данных реквизита "Выбор объекта планирования по аналитике" в контексте сервера.
//
&НаСервере
Процедура БазовыеПланыВыборОбъектаПланированияПоАналитикеПриИзмененииНаСервере()
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.БазовыеПланы.НайтиПоИдентификатору(Элементы.БазовыеПланы.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Справочники.ВидыПлановКомпании.БазовыеПланыВыборОбъектаПланированияПоАналитикеПриИзменении(Объект, ТекущиеДанные);
	
КонецПроцедуры // БазовыеПланыПланированияПоАналитикеПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Выбор объекта планирования по аналитике".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура БазовыеПланыВыборОбъектаПланированияПоАналитикеПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	БазовыеПланыВыборОбъектаПланированияПоАналитикеПриИзмененииНаСервере();
	
КонецПроцедуры // БазовыеПланыВыборОбъектаПланированияПоАналитикеПриИзменении()


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ "ОТЧЕТЫ И ОБРАБОТКИ"

// Обработчик события возникающего при изменении данных реквизита "Выбор вида объекта" в контексте сервера.
//
&НаСервере
Процедура ОтчетыИОбработкиВыборВидаОбъектаПриИзмененииНаСервере()
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.ОтчетыИОбработки.НайтиПоИдентификатору(Элементы.ОтчетыИОбработки.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Справочники.ВидыПлановКомпании.ОтчетыИОбработкиВыборВидаОбъектаПриИзменении(Объект, ТекущиеДанные);
	
КонецПроцедуры // ОтчетыИОбработкиВыборВидаОбъектаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Выбор вида объект".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ОтчетыИОбработкиВыборВидаОбъектаПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ОтчетыИОбработкиВыборВидаОбъектаПриИзмененииНаСервере();
	
КонецПроцедуры // ОтчетыИОбработкиВыборВидаОбъектаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Флаг заполнения факта" в контексте сервера.
//
&НаСервере
Процедура ОтчетыИОбработкиФлагЗаполненияФактаПриИзмененииНаСервере()
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.ОтчетыИОбработки.НайтиПоИдентификатору(Элементы.ОтчетыИОбработки.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Если Справочники.ВидыПлановКомпании.ОтчетыИОбработкиФлагПриИзменении(Объект, ТекущиеДанные) Тогда
		ТекущиеДанные.ФлагЗаполненияФакта = Ложь;
	КонецЕсли;
	
КонецПроцедуры // ОтчетыИОбработкиВыборВидаОбъектаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Флаг заполнения факта".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ОтчетыИОбработкиФлагЗаполненияФактаПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ОтчетыИОбработкиФлагЗаполненияФактаПриИзмененииНаСервере();
	
КонецПроцедуры // ОтчетыИОбработкиФлагЗаполненияФактаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Флаг проверки плана" в контексте сервера.
//
&НаСервере
Процедура ОтчетыИОбработкиФлагПроверкиПланаПриИзмененииНаСервере()
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.ОтчетыИОбработки.НайтиПоИдентификатору(Элементы.ОтчетыИОбработки.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Если Справочники.ВидыПлановКомпании.ОтчетыИОбработкиФлагПриИзменении(Объект, ТекущиеДанные) Тогда
		ТекущиеДанные.ФлагПроверкиПлана = Ложь;
	КонецЕсли;

КонецПроцедуры // ОтчетыИОбработкиФлагПроверкиПланаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Флаг проверки плана".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ОтчетыИОбработкиФлагПроверкиПланаПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ОтчетыИОбработкиФлагПроверкиПланаПриИзмененииНаСервере();
	
КонецПроцедуры // ОтчетыИОбработкиФлагПроверкиПланаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Флаг заполнения плана" в контексте сервера.
//
&НаСервере
Процедура ОтчетыИОбработкиФлагЗаполненияПланаПриИзмененииНаСервере()
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.ОтчетыИОбработки.НайтиПоИдентификатору(Элементы.ОтчетыИОбработки.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Если Справочники.ВидыПлановКомпании.ОтчетыИОбработкиФлагПриИзменении(Объект, ТекущиеДанные) Тогда
		ТекущиеДанные.ФлагЗаполненияПлана = Ложь;
	КонецЕсли;
	
КонецПроцедуры // ОтчетыИОбработкиФлагЗаполненияПланаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Флаг заполнения плана".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ОтчетыИОбработкиФлагЗаполненияПланаПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ОтчетыИОбработкиФлагЗаполненияПланаПриИзмененииНаСервере();
	
КонецПроцедуры // ОтчетыИОбработкиФлагЗаполненияПланаПриИзменении()

// Обработчик события возникающего на клиенте при начале выбора данных реквизита "Путь к объекту".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ОтчетыИОбработкиПутьКОбъектуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Формируем описание обработчика перехвата закрытия формы
	ОбработчикРезультата = Новый ОписаниеОповещения("ОбработкаРезультатаОповещенияПутьКОбъекту", ЭтотОбъект);
	
	Если (Элементы.ОтчетыИОбработки.ТекущиеДанные.ВидОбъекта=2) ИЛИ (Элементы.ОтчетыИОбработки.ТекущиеДанные.ВидОбъекта=4) Тогда
		СписокДляВыбора = Новый СписокЗначений();
		СписокДляВыбора.Добавить("ВЫБРАТЬ ИЗ диалога");
		ПоказатьВыборИзМеню(ОбработчикРезультата,СписокДляВыбора, Элемент);
	ИначеЕсли (Элементы.ОтчетыИОбработки.ТекущиеДанные.ВидОбъекта=3) Тогда
		ПоказатьВыборИзМеню(ОбработчикРезультата,СписокОбработок, Элемент);
	КонецЕсли;
	
КонецПроцедуры // ОтчетыИОбработкиПутьКОбъектуНачалоВыбора()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	Справочники.ВидыПлановКомпании.ОбработкаПересчетаТабличнойЧастиОтчетыИОбработки(Объект,Неопределено);
	Справочники.ВидыПлановКомпании.ОбработкаПересчетаТабличнойЧастиБазовыеПланы(Объект,Неопределено);
	
	ВыбраннаяОбработка = Обработки;
	Для Каждого СтрокаОбработки Из Метаданные.Обработки Цикл
		Если СтрНайти(СтрокаОбработки.Имя,"План")<>0 Тогда
			СписокОбработок.Добавить(СтрокаОбработки.Имя, СтрокаОбработки.Синоним);
		КонецЕсли;
	КонецЦикла;
	
	// Дальнейшие операции выполняются только для новых объектов
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриСозданииНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	// Произведем настройку параметров отображения кнопок командной панели списка Параметры плана.
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(ЭтотОбъект, "ПараметрыПлана");
	
	// Произведем настройку параметров отображения кнопок командной панели списка Базовые планы.
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(ЭтотОбъект, "БазовыеПланы");
	
	// Произведем настройку параметров отображения кнопок командной панели списка Подразделения.
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(ЭтотОбъект, "Подразделения");
	
	// Произведем настройку параметров отображения кнопок командной панели списка Отчеты и обработки.
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(ЭтотОбъект, "ОтчетыИОбработки");
	
КонецПроцедуры // ПриОткрытии()

// Обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

// Обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытии()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы в контексте сервера.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//
&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаВыбораНаСервере()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаВыбора()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Если оповещение сводится к выбору значения, то переходим в обработчик другого события.
	Если ПараметрыДействия.Свойство("ВыбранноеЗначение") Тогда
		ОбработкаВыбораНаСервере(ПараметрыДействия.ВыбранноеЗначение, ПараметрыДействия);
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеДиалогомСправочникаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на сервере при чтении данных объекта.
//
// Параметры:
//  ТекущийОбъект - СправочникОбъект - Объект, который будет прочитан.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;
		
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЧтенииНаСервере()

// Обработчик события возникающего на клиенте перед выполнением записи объекта из формы.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от записи.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаКлиент.ПередЗаписью(ЭтотОбъект, Отказ ,ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры //ПередЗаписью()

// Обработчик события возникающего на сервере перед записью объекта.
//
// Параметры:
//  Отказ           - Булево           - Признак отказа от создания формы.
//  ТекущийОбъект   - СправочникОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура        - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписьюНаСервере()

// Обработчик события возникающего на сервере после записи объекта и после завершения транзакции.
//
// Параметры:
//  ТекущийОбъект   - СправочникОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура        - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	  	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПослеЗаписиНаСервере()

// Обработчик события возникающего на клиенте после записи объекта и после завершения транзакции.
//
// Параметры:
//  ПараметрыЗаписи - Структура - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПослеЗаписи()

// Обработчик события возникающего на сервере при необходимости проверки заполнения реквизитов при записи в форме.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраняемых реквизитов и настроек формы.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомСправочникаСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраненных реквизитов и настроек формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомСправочникаСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ
